module decoder (
    input [2:0] in,
    output reg [7:0] out
);

always @(*) begin
    case (in)
        3'b000: out = 8'b00000001;  // 输入 000 -> 输出 00000001
        3'b001: out = 8'b00000010;  // 输入 001 -> 输出 00000010
        3'b010: out = 8'b00000100;  // 输入 010 -> 输出 00000100
        3'b011: out = 8'b00001000;  // 输入 011 -> 输出 00001000
        3'b100: out = 8'b00010000;  // 输入 100 -> 输出 00010000
        3'b101: out = 8'b00100000;  // 输入 101 -> 输出 00100000
        3'b110: out = 8'b01000000;  // 输入 110 -> 输出 01000000
        3'b111: out = 8'b10000000;  // 输入 111 -> 输出 10000000
        default: out = 8'b00000000; // 默认输出
    endcase
end

endmodule
